espressif/esp-idf/components/soc/esp32h4/register/soc/lp_aon_reg.h
/** LP_AON_IO_LDO_CFG_REG register
 *  need_des
 */
#define LP_AON_IO_LDO_CFG_REG (DR_REG_LP_AON_BASE + 0x84)
/** LP_AON_IO_LDO_3P3_SW : R/W; bitpos: [21]; default: 0;
 *  need_des
 */
#define LP_AON_IO_LDO_3P3_SW    (BIT(21))
#define LP_AON_IO_LDO_3P3_SW_M  (LP_AON_IO_LDO_3P3_SW_V << LP_AON_IO_LDO_3P3_SW_S)
#define LP_AON_IO_LDO_3P3_SW_V  0x00000001U
#define LP_AON_IO_LDO_3P3_SW_S  21
/** LP_AON_IO_LDO_3P3_SW_EN : R/W; bitpos: [22]; default: 0;
 *  need_des
 */
#define LP_AON_IO_LDO_3P3_SW_EN    (BIT(22))
#define LP_AON_IO_LDO_3P3_SW_EN_M  (LP_AON_IO_LDO_3P3_SW_EN_V << LP_AON_IO_LDO_3P3_SW_EN_S)
#define LP_AON_IO_LDO_3P3_SW_EN_V  0x00000001U
#define LP_AON_IO_LDO_3P3_SW_EN_S  22
/** LP_AON_IO_LDO_ADJUST_SW : R/W; bitpos: [30:23]; default: 0;
 *  need_des
 */
#define LP_AON_IO_LDO_ADJUST_SW    0x000000FFU
#define LP_AON_IO_LDO_ADJUST_SW_M  (LP_AON_IO_LDO_ADJUST_SW_V << LP_AON_IO_LDO_ADJUST_SW_S)
#define LP_AON_IO_LDO_ADJUST_SW_V  0x000000FFU
#define LP_AON_IO_LDO_ADJUST_SW_S  23
/** LP_AON_IO_LDO_ADJUST_SW_EN : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define LP_AON_IO_LDO_ADJUST_SW_EN    (BIT(31))
#define LP_AON_IO_LDO_ADJUST_SW_EN_M  (LP_AON_IO_LDO_ADJUST_SW_EN_V << LP_AON_IO_LDO_ADJUST_SW_EN_S)
#define LP_AON_IO_LDO_ADJUST_SW_EN_V  0x00000001U
#define LP_AON_IO_LDO_ADJUST_SW_EN_S  31

/** LP_AON_SRAM_USAGE_CONF_REG register
 *  HP memory usage configuration register
 */
#define LP_AON_SRAM_USAGE_CONF_REG (DR_REG_LP_AON_BASE + 0x98)
/** LP_AON_DCACHE_USAGE : R/W; bitpos: [0]; default: 0;
 *  hp system memory is split to 7 layers(Layer0 ~ Layer6) in total, this field is
 *  used to control the first layer(Layer0) usage. 0: cpu use hp-memory. 1: dcache use
 *  hp-mmory.
 *  By default, dcache is closed, and typically users can enable dcache after
 *  boot-loader, but before user's BIN start running.
 */
#define LP_AON_DCACHE_USAGE    (BIT(0))
#define LP_AON_DCACHE_USAGE_M  (LP_AON_DCACHE_USAGE_V << LP_AON_DCACHE_USAGE_S)
#define LP_AON_DCACHE_USAGE_V  0x00000001U
#define LP_AON_DCACHE_USAGE_S  0
/** LP_AON_ICACHE1_USAGE : R/W; bitpos: [1]; default: 1;
 *  hp system memory is split to 7 layers(Layer0 ~ Layer6) in total, this field is
 *  used to control the last layer(Layer6) usage. 0: cpu use hp-memory. 1: icache1 use
 *  hp-mmory.
 *  By default, icache1 is not disabled, and the last layer memory belongs to icache1.
 *  Typically users can set this bit to 0 to disable icache1 in boot-loader.
 */
#define LP_AON_ICACHE1_USAGE    (BIT(1))
#define LP_AON_ICACHE1_USAGE_M  (LP_AON_ICACHE1_USAGE_V << LP_AON_ICACHE1_USAGE_S)
#define LP_AON_ICACHE1_USAGE_V  0x00000001U
#define LP_AON_ICACHE1_USAGE_S  1

/** LP_AON_PUF_CONF_REG register
 *  PUF mem control config register
 */
#define LP_AON_PUF_CONF_REG (DR_REG_LP_AON_BASE + 0x19c)
/** LP_AON_PUF_SW : R/W; bitpos: [0]; default: 1;
 *  puf mem power switch control signal
 */
#define LP_AON_PUF_SW    (BIT(0))
#define LP_AON_PUF_SW_M  (LP_AON_PUF_SW_V << LP_AON_PUF_SW_S)
#define LP_AON_PUF_SW_V  0x00000001U
#define LP_AON_PUF_SW_S  0
/** LP_AON_PUF_ISO_EN : R/W; bitpos: [1]; default: 0;
 *  iso enable signal for puf mem
 */
#define LP_AON_PUF_ISO_EN    (BIT(1))
#define LP_AON_PUF_ISO_EN_M  (LP_AON_PUF_ISO_EN_V << LP_AON_PUF_ISO_EN_S)
#define LP_AON_PUF_ISO_EN_V  0x00000001U
#define LP_AON_PUF_ISO_EN_S  1
/** LP_AON_PUF_MEM_DISCHARGE : R/W; bitpos: [2]; default: 0;
 *  discharge signal for puf mem
 */
#define LP_AON_PUF_MEM_DISCHARGE    (BIT(2))
#define LP_AON_PUF_MEM_DISCHARGE_M  (LP_AON_PUF_MEM_DISCHARGE_V << LP_AON_PUF_MEM_DISCHARGE_S)
#define LP_AON_PUF_MEM_DISCHARGE_V  0x00000001U
#define LP_AON_PUF_MEM_DISCHARGE_S  2

/** LP_AON_DATE_REG register
 *  reserved
 */
#define LP_AON_DATE_REG (DR_REG_LP_AON_BASE + 0x3fc)
/** LP_AON_CLK_EN : R/W; bitpos: [5]; default: 0;
 *  0: DREG_LDO control by SW;
 *  1: DREG_LDO control by HW;
 */
#define LP_AON_DREG_LDO_HW  BIT(5)
#define LP_AON_DREG_LDO_HW_M  (LP_AON_DREG_LDO_HW_V << LP_AON_DREG_LDO_HW_S)
#define LP_AON_DREG_LDO_HW_V  0x00000001U
#define LP_AON_DREG_LDO_HW_S  5
/** LP_AON_IO_LDO_ADJUST_SW : R/W; bitpos: [14:11]; default: 8;
 *  need_des
 */
#define LP_AON_DREG_LDO_SW    0x0000000FU
#define LP_AON_DREG_LDO_SW_M  (LP_AON_DREG_LDO_SW_V << LP_AON_DREG_LDO_SW_S)
#define LP_AON_DREG_LDO_SW_V  0x0000000FU
#define LP_AON_DREG_LDO_SW_S  11
/** LP_AON_CLK_EN : R/W; bitpos: [31]; default: 0;
 *  version register
 */
#define LP_AON_CLK_EN    (BIT(31))
#define LP_AON_CLK_EN_M  (LP_AON_CLK_EN_V << LP_AON_CLK_EN_S)
#define LP_AON_CLK_EN_V  0x00000001U
#define LP_AON_CLK_EN_S  31

#ifdef __cplusplus
}
#endif
